app/Controllers/Partes.php

SELECT *
FROM `empleados`
WHERE `activo` = 1
SELECT *
FROM `localidades`
---
public function nuevo()
    {
        $empleadoModel = new EmpleadoModel();
        $localidadModel = new LocalidadModel();

        // Obtiene solo empleados activos
        $data['empleados'] = $empleadoModel->where('activo', 1)->findAll();
        // Obtiene todas las localidades
        $data['localidades'] = $localidadModel->findAll();

SELECT *
FROM `partes`
WHERE `partes`.`id` = '9087'
SELECT *
FROM `empleados`
WHERE `activo` = 1
SELECT *
FROM `localidades`
---
	 public function editarParte($id)
    {
        $parteModel = new ParteModel();
		$localidadModel = new LocalidadModel();
        $parte = $parteModel->find($id);
        if (!$parte) {
            return redirect()->back()->with('error', 'Parte no encontrado.');
        }


        $empleadoModel = new EmpleadoModel();
		$data['empleados'] = $empleadoModel->where('activo', 1)->findAll();

        $data['localidades'] = $localidadModel->findAll();