app/Models/EmpleadoModel.php

    public function findAllEmpleados()
    {
        return $this->findAll();
---
SELECT *
FROM `empleados`