app/Models/ParteModel.php

SELECT `partes`.*, `e1`.`nombre` AS `empleado_nombre`, `e1`.`apellido` AS `empleado_apellido`, `e2`.`nombre` AS `empleado2_nombre`, `e2`.`apellido` AS `empleado2_apellido`, `e3`.`nombre` AS `empleado3_nombre`, `e3`.`apellido` AS `empleado3_apellido`, `e4`.`nombre` AS `empleado4_nombre`, `e4`.`apellido` AS `empleado4_apellido`, `e5`.`nombre` AS `empleado5_nombre`, `e5`.`apellido` AS `empleado5_apellido`, `localidades`.`nombre` AS `localidad_nombre`
FROM `partes`
LEFT JOIN `empleados` as `e1` ON `partes`.`id_profesional` = `e1`.`id`
LEFT JOIN `empleados` as `e2` ON `partes`.`id_profesional2` = `e2`.`id`
LEFT JOIN `empleados` as `e3` ON `partes`.`id_profesional3` = `e3`.`id`
LEFT JOIN `empleados` as `e4` ON `partes`.`id_profesional4` = `e4`.`id`
LEFT JOIN `empleados` as `e5` ON `partes`.`id_profesional5` = `e5`.`id`
LEFT JOIN `localidades` ON `partes`.`localidad` = `localidades`.`id`
WHERE   (
`partes`.`numero_de_expediente` LIKE '%V56135371%' ESCAPE '!'
OR  `partes`.`telefono` LIKE '%V56135371%' ESCAPE '!'
OR  `partes`.`direccion` LIKE '%V56135371%' ESCAPE '!'
 )
AND `fecha_parte` >= '2024-05-09'
AND `fecha_parte` <= '2025-12-31'
AND `partes`.`activo` = 1
ORDER BY `partes`.`id` DESC
---
    public function searchPartes($search, $profesionalId = null, $fechaInicio = null, $fechaFin = null)
    {
        if ($search) {
            $this->groupStart();
            $this->like('partes.numero_de_expediente', $search);
            $this->orLike('partes.telefono', $search);
            $this->orLike('partes.direccion', $search);
            $this->groupEnd();
        }

        if ($profesionalId) {
            $this->groupStart();
            $this->where('partes.id_profesional', $profesionalId);
            $this->orWhere('partes.id_profesional2', $profesionalId);
            $this->orWhere('partes.id_profesional3', $profesionalId);
            $this->orWhere('partes.id_profesional4', $profesionalId);
            $this->orWhere('partes.id_profesional5', $profesionalId);
            $this->groupEnd();
        }

        if ($fechaInicio && $fechaFin) {
            $this->where('fecha_parte >=', $fechaInicio);
            $this->where('fecha_parte <=', $fechaFin);
        }

        return $this->select('partes.*, e1.nombre AS empleado_nombre, e1.apellido AS empleado_apellido,
                                  e2.nombre AS empleado2_nombre, e2.apellido AS empleado2_apellido,
                                  e3.nombre AS empleado3_nombre, e3.apellido AS empleado3_apellido,
                                  e4.nombre AS empleado4_nombre, e4.apellido AS empleado4_apellido,
                                  e5.nombre AS empleado5_nombre, e5.apellido AS empleado5_apellido,
                                  localidades.nombre AS localidad_nombre')
                ->join('empleados as e1', 'partes.id_profesional = e1.id', 'left')
                ->join('empleados as e2', 'partes.id_profesional2 = e2.id', 'left')
                ->join('empleados as e3', 'partes.id_profesional3 = e3.id', 'left')
                ->join('empleados as e4', 'partes.id_profesional4 = e4.id', 'left')
                ->join('empleados as e5', 'partes.id_profesional5 = e5.id', 'left')
                ->join('localidades', 'partes.localidad = localidades.id', 'left')
                ->where('partes.activo', 1)
                ->orderBy('partes.id', 'DESC')
                ->findAll();

INSERT INTO `partes` (`numero_de_expediente`, `nombre`, `telefono`, `direccion`, `localidad`, `cp`, `fecha_parte`, `tipo`, `importe`, `estado`, `id_profesional`, `id_profesional2`, `id_profesional3`, `id_profesional4`, `id_profesional5`, `empleado_comision`, `abre_nueva_asistencia`, `descripcion_del_trabajo`, `codigos`, `interviene_taller`, `ha_realizado_fotos`, `reclamacion`, `observaciones`, `ofrece_asistencia`, `felicitacion`, `hay_que_limpiar`, `ha_limpiado`, `activo`, `fecha_ultima_modificacion`) VALUES ('V56693791', 'PASTOR IBARRA,OSCAR', '605048025', 'CL MONTE OLIVETTI 33 B 1 ID', '85', '28038', '2026-01-07', '0', '125.35', '1', '59', '', '', '', '', '', 'No se abre otra sistencia', 'Suministro y colocación una tira de rodapié 90X12 BLANCO REDONDO', 'YYT, RAT, RDT(4.5), BOT', 1, 1, '', '', 0, 0, 0, 0, 1, '2026-01-07')
---
    // Establece 'fecha_ultima_modificacion' a la fecha actual
    $data['fecha_ultima_modificacion'] = date('Y-m-d');

    if ($this->insert($data)) {