app/Models/UsuarioModel.php

SELECT *
FROM `usuarios`
WHERE `email` = 'administracion@fjparrado.com'
 LIMIT 1
---
    public function getByEmail($email)
    {
        return $this->asArray()
                    ->where(['email' => $email])
                    ->first();